IOsonata/IOsonata/ARM/Nordic/nRF54/src/bt_app_bm.cpp
#define BT_APP_SEC_PARAM_MIN_KEY_SIZE	7
#define BT_APP_SEC_PARAM_MAX_KEY_SIZE	16

static void BtAppPmEvtHandler(const struct pm_evt *p_evt)
{
	// IOsonata starts security once from BtAppRun for both new and restored
	// peers. The Nordic helper also starts it immediately for a restored peer,
	// before the remaining CONNECTED observers run, so skip that one helper
	// action while preserving its handling for all other Peer Manager events.
	if (p_evt->evt_id != PM_EVT_BONDED_PEER_CONNECTED)
	{
		pm_handler_on_pm_evt(p_evt);
	}
	pm_handler_disconnect_on_sec_failure(p_evt);
	pm_handler_flash_clean(p_evt);

	switch (p_evt->evt_id)
	{
		case PM_EVT_CONN_SEC_SUCCEEDED:
			BtSmpOobDataClear();
			// Link is encrypted. peer_manager holds the bond. Notify the app so
			// it can run work that needs an encrypted link (e.g. a central
			// reading protected characteristics). (nRF52 optionally enforces
			// MITM here; left permissive.)
			BtAppEvtSecured(p_evt->conn_handle);
			break;

		case PM_EVT_CONN_SEC_FAILED:
			BtSmpOobDataClear();
			// Security setup failed. pm_handler_disconnect_on_sec_failure above
			// already tears the link down when required.
			break;

		case PM_EVT_CONN_SEC_CONFIG_REQ:
		{
			// Allow an already-bonded peer to re-pair.
			struct pm_conn_sec_config cfg = { .allow_repairing = true };
			pm_conn_sec_config_reply(p_evt->conn_handle, &cfg);
		}
			break;

		case PM_EVT_STORAGE_FULL:
			// The IOsonata bt_pds store compacts itself on write, so unlike the
			// nRF52 fds_gc() path there is nothing to trigger here.
			break;

		case PM_EVT_PEERS_DELETE_SUCCEEDED:
			// Bonds cleared. Resume advertising if we are a peripheral.
			if (g_BtAppData.AppDevice.Conn.Role &
				(BTAPP_ROLE_PERIPHERAL | BTAPP_ROLE_BROADCASTER))
			{
				BtAdvStart();
			}
			break;

		default:
			break;
	}
}

// Initialize peer_manager and LESC. Maps the app SecType / key-exchange config
// onto ble_gap_sec_params_t exactly as the nRF52 port does (the BTAPP_SECTYPE_*
// values alias the same BT_GAP_SECTYPE_* the nRF52 BLEAPP_SECTYPE_* use).
static uint32_t BtAppPeerMngrInit(BTGAP_SECTYPE SecType, uint8_t SecKeyExchg, bool bEraseBond)
{
	ble_gap_sec_params_t sec_param;
	uint32_t err_code;

	// Provide the LESC layer its ECDH engine BEFORE pm_init. pm_init ->
	// sm_init (the IOsonata bt_sec_bm security manager) calls BtLescInit, which
	// requires the engine to be injected at that point, else pairing has no
	// P-256 provider. The App owns the engine and injects it. On nRF54L15 the
	// P-256 hardware is the Silex BA414EP (Ba414ep), reached through the CRACEN
	// crypto interface the
	// same way a sensor reaches its bus. Its randomness for key generation and
	// blinding comes from the security-grade hardware RNG (CryptoRngNrf).
	static Ba414ep s_LescEcdh;
	Ba414ep *pLescEcdh = nullptr;
	if (s_LescEcdh.Init(CracenIntrfInstance(), CryptoRngNrfInstance()))
	{
		pLescEcdh = &s_LescEcdh;
		DEBUG_PRINTF("Crypto ECDH engine: Ba414ep (hardware P-256)\r\n");
	}
	else
	{
		// The P-256 engine did not come up. LE Secure Connections pairing
		// cannot run. Report it here rather than at the first pairing attempt.
		DEBUG_PRINTF("Crypto ECDH engine MISSING, LESC pairing will fail\r\n");
	}

	BtLescSetCryptoEngine(pLescEcdh);

	err_code = pm_init();
	if (err_code != NRF_SUCCESS)
	{
		DEBUG_PRINTF("pm_init failed: 0x%x\r\n", err_code);
		return err_code;
	}

	if (bEraseBond)
	{
		(void)pm_peers_delete();
	}

	memset(&sec_param, 0, sizeof(sec_param));

	sec_param.bond           = 1;
	sec_param.min_key_size   = BT_APP_SEC_PARAM_MIN_KEY_SIZE;
	sec_param.max_key_size   = BT_APP_SEC_PARAM_MAX_KEY_SIZE;
	sec_param.kdist_own.enc  = 1;
	sec_param.kdist_own.id   = 1;
	sec_param.kdist_peer.enc = 1;
	sec_param.kdist_peer.id  = 1;

	switch (SecType)
	{
		case BTGAP_SECTYPE_NONE:
		case BTGAP_SECTYPE_STATICKEY_NO_MITM:
			break;
		case BTGAP_SECTYPE_STATICKEY_MITM:
			sec_param.mitm = 1;
			break;
		case BTGAP_SECTYPE_LESC_MITM:
			sec_param.mitm = 1;
			sec_param.lesc = 1;
			break;
		case BTGAP_SECTYPE_SIGNED_NO_MITM:
			sec_param.lesc = 1;
			break;
		case BTGAP_SECTYPE_SIGNED_MITM:
			sec_param.mitm = 1;
			sec_param.lesc = 1;
			break;
		default:
			break;
	}

	int exchg = SecKeyExchg & (BTAPP_SECEXCHG_KEYBOARD | BTAPP_SECEXCHG_DISPLAY | BTAPP_SECEXCHG_YESNO);
	switch (exchg)
	{
		case BTAPP_SECEXCHG_KEYBOARD:
			sec_param.keypress = 1;
			sec_param.io_caps  = BLE_GAP_IO_CAPS_KEYBOARD_ONLY;
			break;
		case BTAPP_SECEXCHG_DISPLAY:
			sec_param.io_caps  = BLE_GAP_IO_CAPS_DISPLAY_ONLY;
			break;
		case (BTAPP_SECEXCHG_DISPLAY | BTAPP_SECEXCHG_YESNO):
			sec_param.io_caps  = BLE_GAP_IO_CAPS_DISPLAY_YESNO;
			break;
		case (BTAPP_SECEXCHG_KEYBOARD | BTAPP_SECEXCHG_DISPLAY):
		case (BTAPP_SECEXCHG_KEYBOARD | BTAPP_SECEXCHG_DISPLAY | BTAPP_SECEXCHG_YESNO):
			sec_param.keypress = 1;
			sec_param.io_caps  = BLE_GAP_IO_CAPS_KEYBOARD_DISPLAY;
			break;
		default:
			break;
	}

	if (s_BtSmpAuthCfg.bSet)
	{
		sec_param.bond = (s_BtSmpAuthCfg.AuthReq &
						  BT_SMP_AUTHREQ_BONDING_FLAG_MASK) !=
						 BT_SMP_AUTHREQ_BONDING_FLAG_NO_BONDING;
		sec_param.mitm = (s_BtSmpAuthCfg.AuthReq & BT_SMP_AUTHREQ_MITM) != 0;
		sec_param.lesc = (s_BtSmpAuthCfg.AuthReq & BT_SMP_AUTHREQ_SC) != 0;
		sec_param.keypress = (s_BtSmpAuthCfg.AuthReq & BT_SMP_AUTHREQ_KEYPRESS) != 0;

		switch (s_BtSmpAuthCfg.IoCaps)
		{
			case BT_SMP_IOCAPS_DISPLAY_ONLY:
				sec_param.io_caps = BLE_GAP_IO_CAPS_DISPLAY_ONLY;
				break;
			case BT_SMP_IOCAPS_DISPLAY_YESNO:
				sec_param.io_caps = BLE_GAP_IO_CAPS_DISPLAY_YESNO;
				break;
			case BT_SMP_IOCAPS_KEYBOARD_ONLY:
				sec_param.io_caps = BLE_GAP_IO_CAPS_KEYBOARD_ONLY;
				break;
			case BT_SMP_IOCAPS_KEYBOARD_DISPLAY:
				sec_param.io_caps = BLE_GAP_IO_CAPS_KEYBOARD_DISPLAY;
				break;
			case BT_SMP_IOCAPS_NO_INPUT_NO_OUTPUT:
			default:
				sec_param.io_caps = BLE_GAP_IO_CAPS_NONE;
				break;
		}
	}

	if (SecKeyExchg & BTAPP_SECEXCHG_OOB)
	{
		sec_param.oob = 1;
	}

	err_code = pm_sec_params_set(&sec_param);
	if (err_code != NRF_SUCCESS)
	{
		DEBUG_PRINTF("pm_sec_params_set failed: 0x%x\r\n", err_code);
		return err_code;
	}

	err_code = pm_register(BtAppPmEvtHandler);
	if (err_code != NRF_SUCCESS)
	{
		DEBUG_PRINTF("pm_register failed: 0x%x\r\n", err_code);
		return err_code;
	}

	// LESC is initialized by the IOsonata security manager (bt_sec_bm.cpp)
	// inside pm_init -> sm_init, which owns the BtLesc key pair and injected
	// crypto engine. Only the staged peer OOB data routing is set up here, so
	// the SoftDevice receives it when it asks (LESC OOB association model).
	BtLescOobPeerHandlerSet(BtAppOobPeerDataHandler);

	return NRF_SUCCESS;
}

/**
 * @brief Initialize the Bluetooth application.
 *
 * This function initializes the SoftDevice, BLE stack, GAP parameters,
 * GATT services, advertising, and security.
 */
bool BtAppInit(const BtAppCfg_t *pCfg)
{
	uint32_t err_code;

	// Initialize application event handler
	if (AppEvtHandlerInit(pCfg->pEvtHandlerQueMem, pCfg->EvtHandlerQueMemSize) == false)
	{
		return false;
	}

	// Populate internal app data from config
	g_BtAppData.AppDevice.Conn.Role = pCfg->Role;
	g_BtAppData.AdvHdl = BLE_GAP_ADV_SET_HANDLE_NOT_SET;
	if (!BtPeerInit(pCfg->pPeerPoolMem, pCfg->PeerPoolMemSize))
	{
		return false;
	}

	// Split the long-write reassembly pool across the peer slots so each
	// link gets its own buffer (per Conn.pLongWrBuff).
	BtPeerLongWrInit(pCfg->pLongWrPoolMem, pCfg->LongWrPoolMemSize);

	// Connection pool removed: the peer manager (BtPeerInit above) owns
	// the single connection table now.
	// bExtAdv is no longer a config field; BtAdvEncode determines extended vs
	// legacy from the encoded payload and sets g_BtAppData.bExtAdv during
	// BtAppAdvInit.
	g_BtAppData.ConnLedPort = pCfg->ConnLedPort;
	g_BtAppData.ConnLedPin = pCfg->ConnLedPin;
	g_BtAppData.ConnLedActLevel = pCfg->ConnLedActLevel;
	g_BtAppData.bScan = false;
	g_BtAppData.AppDevice.VendorId = pCfg->VendorId;
	g_BtAppData.AppDevice.ProductId = pCfg->ProductId;
	g_BtAppData.AppDevice.ProductVer = pCfg->ProductVer;
	g_BtAppData.AppDevice.Appearance = pCfg->Appearance;

